Revit 2027 API
BuiltInFailures.SketchFailures.TooManySlopes Property
 There is more than one slope defined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManySlopes { get; }
Public Shared ReadOnly Property TooManySlopes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManySlopes {
	FailureDefinitionId^ get ();
}
static member TooManySlopes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace